% 本文件根据原工程vio的均衡滤波器系数，逆向计算光纤信道单位冲激响应

clc, clear, close all;

fs = 15.36e9/8;     % 原工程在8倍抽取后均衡
h_lms = [-0.0038585663,  0.0025768280,  0.0011262894, -0.0207519531,... 
         -0.0077857971, -0.0051803589,  0.0024700165, -0.0120239258,...
          0.0051765442,  0.0116577148,  0.0003547668, -0.0078430176,...
          0.0079956055, -0.0699462891, -0.0931396484,  0.9184570313];   % 原工程vio中均衡滤波器系数

% 滤波器频率响应
[H, w] = freqz(h_lms, 1, 1024);
f = w/(2*pi)*fs;

% 信道单位冲激响应
C = 1./H;
h_c = real(ifft(C, 1024));

% 绘图
subplot(211);
plot(f/10e6, 20*log10(abs(C)/abs(max(C))));
xlabel('频率 (MHZ)');
ylabel('幅度 (dB)');
title('信道频率响应');
subplot(212);
plot(f/10e6, 20*log10(abs(H)/abs(max(H))));
xlabel('频率 (MHZ)');
ylabel('幅度 (dB)');
title('滤波器频率响应');